# Practice Assignment :: 01

## How to import pandas and check the version?

In [1]:
import pandas as pd

In [2]:
pd.__version__

'1.0.1'

## import useful libraries

In [3]:
import numpy as np

In [4]:
import matplotlib.pyplot as plt

## How to create a series from a list, numpy array and dict?

In [5]:
## List, Numpy Array and dict
lst = ['a', 'b', 'c']
naray = np.array(range(10))
ndict = {"lock":100, "bulb": 50}

In [6]:
s1 = pd.Series(lst)
s2 = pd.Series(naray)
s3 = pd.Series(ndict)

print(f"List to Series:{s1},\n Array to Series: {s2},\n Dict to Series: {s3}")

List to Series:0    a
1    b
2    c
dtype: object,
 Array to Series: 0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int32,
 Dict to Series: lock    100
bulb     50
dtype: int64

## How to convert the index of a series into a column of a dataframe?

## hint::
### Convert the series ser into a dataframe with its index as another column on the dataframe.

In [20]:
srs = pd.Series(["Q1", "Q2", "Q3", "Q4"], name="Quater")
print(srs)

0    Q1
1    Q2
2    Q3
3    Q4
Name: Quater, dtype: object

In [21]:
df = srs.to_frame().reset_index()
print(df)

   index Quater
0      0     Q1
1      1     Q2
2      2     Q3
3      3     Q4

# How to combine many series to form a dataframe?

In [27]:
srs1 = pd.Series(["abc", "def", "jkl"], name = "Alphabets")
srs2 = pd.Series([1,2,3], name="Numbers")

data = {"Alphabets": srs1,
       "Numbers": srs2}

In [32]:
df = pd.concat(data, axis = 1)
print(df)

df1 = pd.DataFrame(srs1.append(srs2, ignore_index=True))
print(df1)

  Alphabets  Numbers
0       abc        1
1       def        2
2       jkl        3
     0
0  abc
1  def
2  jkl
3    1
4    2
5    3

# How to calculate the number of characters in each word in a series?

In [37]:
names= pd.Series(['Ali', 'Anwar', 'Qasim', 1], name = "Names")

In [38]:
names.str.len()

0    3.0
1    5.0
2    5.0
3    NaN
Name: Names, dtype: float64

# How to filter valid emails from a series?

## Desired Output::
1    rameses@egypt.com

2            matt@t.com

3    narendra@modi.com

In [47]:
import re
regex = '^(\w|\.|\_|\-)+[@](\w|\_|\-|\.)+[.]\w{2,3}$'
emails = pd.Series(["rameses@egypt.com","rameses@egypt@com", "matt@t.com", "narendra@modi.com", "abc@abc@.com"], name = "emails")

In [54]:
valid_email = []
def check(emails):
 for mail in emails:
    if(re.search(regex, mail)):
        valid_email.append(mail)
 for v in valid_email:
    print(v)

check(emails)

rameses@egypt.com
matt@t.com
narendra@modi.com

# How to replace missing spaces in a string with the least frequent character?

## Input::
###  my_str = 'dbc deb abed gade'
## Desired Output::
### 'dbccdebcabedcgade'  # least frequent is 'c'

In [55]:
my_str = 'dbc deb abed gade'

In [73]:
series = pd.Series(list(my_str))
counts = series.value_counts()
a = counts.dropna().index[-2]  # least frequent values are two "g", "c"
print(a) 
series1 = "".join(series.replace(" ", a))
series1

c

'dbccdebcabedcgade'

# How to swap two rows of a dataframe?

In [89]:
df = pd.DataFrame(data = [["name", "ali"],["age", "35"]], index = ["a", "b"], columns = ["v1", "v2"])
df

     v1   v2
a  name  ali
b   age   35

In [90]:
df.reindex(["b", "a"])

     v1   v2
b   age   35
a  name  ali

# How to get the positions where values of two columns match?

In [99]:
df = pd.DataFrame({'A': ['alice', 'bob'    , 'charlie'  , 'dave' , 'dave'], 
                   'B': ['andy' , 'bob', 'charlotte', 'dave', 'andy'], 
                   'C': ['some' , 'other'  , 'stuff'    , 'here' , 'andy' ]})
df

         A          B      C
0    alice       andy   some
1      bob        bob  other
2  charlie  charlotte  stuff
3     dave       dave   here
4     dave       andy   andy

In [104]:
a = set(df['A'])
b = set(df['B'])
c = set(df['C'])    
print(a.intersection(b))

{'bob', 'dave'}

# How to replace both the diagonals of dataframe with 0?

In [116]:
df = pd.DataFrame(np.random.randint(1,25, 25).reshape(5, 5))
df

    0   1   2   3   4
0  24   3  14   5   5
1  13   5   7  17   4
2  21  10  20   3   3
3   9   7  12   7  12
4  24   1  17   1   1

In [120]:
for i in range(len(df.index)):
    for j in range(len(df.columns)):
        if i==j:
            df.loc[i,j] = 0
            
df

    0   1   2  3   4
0   0   3  14  5   0
1  13   0   7  0   4
2  21  10   0  3   3
3   9   0  12  0  12
4   0   1  17  1   0

# How to get the particular group of a groupby dataframe by key?

### This is a question related to understanding of grouped dataframe.

In [135]:
df = pd.DataFrame({"number": [1, 1, 2, 2, 3],
                   "sum": [1,1,2,2,4]})
df1=df.groupby(by="number").sum()
df1

        sum
number
1         2
2         4
3         4

In [145]:
df1.groupby(["sum"]).sum().index.get_level_values(0)

Int64Index([2, 4], dtype='int64', name='sum')

# Which column contains the highest number of row-wise maximum values?

### Obtain the column name with the highest number of row-wise maximumâ€™s in df.

In [146]:
df = pd.DataFrame({"Jan": [500, 100, 599],
                  "Feb": [100, 30, 50],
                  "Apr": [33, 90, 10]})
df

   Jan  Feb  Apr
0  500  100   33
1  100   30   90
2  599   50   10

In [149]:
df.idxmax(axis=1)

0    Jan
1    Jan
2    Jan
dtype: object